Repository: shusfun/cc-connect
Catalog: CodexMobile/CodexMobile/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: Edit Device Name
zh_hans: 编辑设备名称

source: Edit Goal
zh_hans: 编辑目标

source: Edit Objective
zh_hans: 编辑目标内容

source: Edit device name
zh_hans: 编辑设备名称

source: Edit goal
zh_hans: 编辑目标

source: Edited
zh_hans: 已编辑

source: End-to-End Encryption
zh_hans: 端到端加密

source: End-to-end encrypted
zh_hans: 端到端加密

source: Ended with error
zh_hans: 因错误结束

source: Enjoy Markdown in your own messages and faster, smoother streaming responses.
zh_hans: 你的消息也支持 Markdown，流式回复更快、更流畅。

source: Enter a valid pairing code.
zh_hans: 请输入有效的配对码。

source: Enter
zh_hans: 回车

source: Error while sending message
zh_hans: 发送消息时出错

source: Error
zh_hans: 错误

source: Error: %@
zh_hans: 错误：%@

source: Everything runs on your device. Your phone is the remote.
zh_hans: 任务运行在你的设备上。 手机只是操作终端。

source: Exceptional
zh_hans: 极高

source: Exit code
zh_hans: 退出码

source: Exited
zh_hans: 已退出

source: Expand All
zh_hans: 全部展开

source: Expand all
zh_hans: 全部展开

source: Expand commands
zh_hans: 展开命令

source: Expand file changes
zh_hans: 展开文件修改

source: Expand plan
zh_hans: 展开计划

source: Expand previous messages
zh_hans: 展开较早消息

source: Expand project controls
zh_hans: 展开项目操作

source: Expand review details
zh_hans: 展开审查详情

source: Expand subagents
zh_hans: 展开子代理

source: Expand
zh_hans: 展开

source: Expands all project folders
zh_hans: 展开所有项目文件夹

source: Expands goal details
zh_hans: 展开目标详情

source: Expired
zh_hans: 已过期

source: Extra High
zh_hans: 超高

source: Failed
zh_hans: 失败

source: Fast Mode
zh_hans: 快速模式

source: Fast mode
zh_hans: 快速模式

source: Fast
zh_hans: 快速

source: Feature branch ready
zh_hans: 功能分支已就绪

source: Feedback
zh_hans: 反馈

source: Fetching the latest messages for this conversation.
zh_hans: 正在获取此任务的最新消息。

source: File changes
zh_hans: 文件修改

source: File preview response did not include file content.
zh_hans: 文件预览响应未包含文件内容。

source: File preview response was missing a result.
zh_hans: 文件预览响应缺少结果。

source: Files
zh_hans: 文件

source: Fill in the connection
zh_hans: 填写连接信息

source: Find active and unread chats faster with improved sorting, status indicators, and automation labels.
zh_hans: 通过改进的排序、状态标记和自动化标签，更快找到活动与未读任务。

source: Find the PC IP, then use it in Remodex
zh_hans: 查找电脑 IP，然后在 Remodex 中填写

source: Finding
zh_hans: 正在查找

source: Finish the active run in this repo before undoing this response.
zh_hans: 撤销此回复前，请先结束仓库中正在运行的任务。

source: Finished with error
zh_hans: 结束时发生错误

source: Finished, not opened yet
zh_hans: 已完成，尚未查看

source: Finished
zh_hans: 已结束

source: Folder name
zh_hans: 文件夹名称

source: Folders
zh_hans: 文件夹

source: Follow System
zh_hans: 跟随系统

source: Follow up
zh_hans: 继续追问

source: Font
zh_hans: 字体

source: Force Close & Continue
zh_hans: 强制关闭并继续

source: Forget Pair
zh_hans: 解除配对

source: Forget this device?
zh_hans: 移除此设备？

source: Forget
zh_hans: 移除

source: Fork into local
zh_hans: 分叉到本地

source: Fork into new worktree
zh_hans: 分叉到新工作树

source: Fork this thread into a new local thread.
zh_hans: 将此任务分叉为新的本地任务。

source: Fork this thread into a new worktree.
zh_hans: 将此任务分叉到新工作树。

source: Fork this thread into local or a new worktree
zh_hans: 将任务分叉到本地或新工作树

source: Fork this thread into local or a new worktree.
zh_hans: 将任务分叉到本地或新工作树。

source: Fork this thread.
zh_hans: 分叉此任务。

source: Fork thread into new worktree
zh_hans: 将任务分叉到新工作树

source: Fork
zh_hans: 分叉

source: Found
zh_hans: 已找到

source: Fresh New Look
zh_hans: 全新外观

source: Full access
zh_hans: 完全访问

source: Full computer access (elevated risk)
zh_hans: 完全访问设备（风险较高）

source: Full
zh_hans: 完整

source: Generate commit message
zh_hans: 生成提交说明

source: Generated image
zh_hans: 生成的图片

source: Generating commit message...
zh_hans: 正在生成提交说明…

source: Get Started
zh_hans: 开始使用

source: Git Error
zh_hans: Git 错误

source: Git Writer
zh_hans: Git 写入

source: Git actions
zh_hans: Git 操作

source: Git from your phone
zh_hans: 在手机上操作 Git

source: Git is not initialized
zh_hans: 尚未初始化 Git

source: Git operation failed.
zh_hans: Git 操作失败。

source: Git status is still loading. Wait a moment and retry.
zh_hans: Git 状态仍在加载，请稍后重试。

source: Goal %@, %@
zh_hans: 目标 %@，%@

source: Goal %@
zh_hans: 目标 %@

source: Goal needs attention
zh_hans: 目标需要处理

source: Goal running
zh_hans: 目标正在推进

source: Goal
zh_hans: 目标

source: Goals are not available on the connected Codex runtime. Update the Codex CLI on your Mac (npm install -g @openai/codex@latest) and enable the goals feature.
zh_hans: 当前 Codex 运行时不支持目标功能，请更新设备上的 Codex 并启用该功能。

source: Goals need a saved chat. This chat is temporary, so a goal cannot be attached to it.
zh_hans: 目标需要已保存的任务，临时任务无法添加目标。

source: Goals
zh_hans: 目标

source: Got It
zh_hans: 知道了

source: Green
zh_hans: 绿色

source: HKDF-SHA256, per-direction keys
zh_hans: HKDF-SHA256，双向独立密钥

source: Hand off thread to worktree
zh_hans: 将任务移交到工作树

source: Hand off to Desktop
zh_hans: 移交到桌面端

source: Hand off to Local
zh_hans: 移交到本地

source: Hand off to Worktree
zh_hans: 移交到工作树

source: Hand off
zh_hans: 移交

source: Handles session discovery so your phone finds the device's live session
zh_hans: 通过会话发现，让手机找到设备的在线会话

source: Here’s what changed in this build.
zh_hans: 此版本的更新内容。

source: Hi! How can I help you?
zh_hans: 你好！有什么可以帮你？

source: Hide
zh_hans: 隐藏

source: Hides the local and branch pickers
zh_hans: 隐藏本地与分支选择器

source: High
zh_hans: 高

source: How It Works
zh_hans: 工作原理

source: How Remodex Works
zh_hans: Remodex 工作原理

source: I Updated It
zh_hans: 我已更新

source: I hit this Remodex error:
zh_hans: 我遇到了以下 Remodex 错误：

source: ISC License
zh_hans: ISC 许可证

source: Identity
zh_hans: 身份

source: Idle
zh_hans: 空闲

source: Image Preview
zh_hans: 图片预览

source: Image preview response did not include image data.
zh_hans: 图片预览响应未包含图片数据。

source: Image preview response did not include valid image data.
zh_hans: 图片预览响应未包含有效图片数据。

source: Image preview response was missing a result.
zh_hans: 图片预览响应缺少结果。

source: Image request
zh_hans: 图片请求

source: Image
zh_hans: 图片

source: Implement
zh_hans: 实施

source: Import
zh_hans: 导入

source: Imported
zh_hans: 已导入

source: Improved Terminal
zh_hans: 终端改进

source: In Remodex, enter the connection as user@address, give it a nickname, paste the private key, and leave the port as 22 unless you changed it.
zh_hans: 在 Remodex 中以 user@address 填写连接，设置备注并粘贴私钥。除非更改过端口，否则使用 22。

source: In progress
zh_hans: 进行中

source: Indigo
zh_hans: 靛蓝色

source: Initialize Git
zh_hans: 初始化 Git

source: Initializing Git...
zh_hans: 正在初始化 Git…

source: Input needed
zh_hans: 需要输入

source: Insert a canned prompt that asks Codex to delegate work
zh_hans: 插入请求 Codex 分配工作的预设提示词

source: Install OpenSSH Server
zh_hans: 安装 OpenSSH Server

source: Install the latest Remodex build on this iPhone, then come back here and reconnect.
zh_hans: 请在此 iPhone 安装新版 Remodex，然后返回并重新连接。

source: Installed
zh_hans: 已安装

source: Instructions sent
zh_hans: 说明已发送

source: Instructions
zh_hans: 说明

source: Intelligence
zh_hans: 智能

source: Interactive
zh_hans: 交互式

source: Interrupted
zh_hans: 已中断

source: Invalid response from bridge.
zh_hans: Bridge 返回了无效响应。

source: Invalid server URL: %@
zh_hans: 服务器地址无效：%@

source: It travels through the relay to the bridge on your device
zh_hans: 消息经过中继，到达设备上的 Bridge

source: JSONL rollout
zh_hans: JSONL 运行记录

source: Keep messages, models, queues, approvals, unread status, and active conversations synchronized between Remodex and Codex Desktop.
zh_hans: 在 Remodex 与 Codex 桌面端之间同步消息、模型、队列、审批、未读状态和活动任务。

source: Key derivation
zh_hans: 密钥派生

source: Key exchange
zh_hans: 密钥交换

source: Keychain-backed AES key
zh_hans: 保存在钥匙串中的 AES 密钥

source: Known Host
zh_hans: 已知主机

source: Language
zh_hans: 语言

source: Last run failed
zh_hans: 上次运行失败

source: Later launches auto-reconnect — no QR needed
zh_hans: 后续启动自动重连，无需再次扫码

source: Latest update
zh_hans: 最近更新

source: Latest update: %@
zh_hans: 最近更新：%@

source: Left
zh_hans: 向左

source: Let Codex review approval requests automatically, see what access is needed, and retry denied actions with one tap.
zh_hans: 让 Codex 自动审核审批请求，查看所需权限，并点按重试被拒绝的操作。

source: Line %@
zh_hans: 第 %@ 行

source: Lines %@-%@
zh_hans: 第 %@–%@ 行

source: Linux device
zh_hans: Linux 设备

source: List files %@
zh_hans: 列出文件 %@

source: List files
zh_hans: 列出文件

source: Listed
zh_hans: 已列出

source: Listing
zh_hans: 正在列出

source: Live Desktop Sync
zh_hans: 桌面实时同步

source: Live plan
zh_hans: 当前计划

source: Load earlier messages
zh_hans: 加载较早消息

source: Loading base branches...
zh_hans: 正在加载基准分支…

source: Loading chat...
zh_hans: 正在加载任务…

source: Loading chats
zh_hans: 正在加载任务

source: Loading chats...
zh_hans: 正在加载任务…

source: Loading chats…
zh_hans: 正在加载任务…

source: Loading current limits...
zh_hans: 正在加载当前限额…

source: Loading earlier messages...
zh_hans: 正在加载较早消息…

source: Loading folders...
zh_hans: 正在加载文件夹…

source: Loading model options…
zh_hans: 正在加载模型选项…

source: Loading models…
zh_hans: 正在加载模型…

source: Loading plugins...
zh_hans: 正在加载插件…

source: Loading recent messages...
zh_hans: 正在加载最近消息…

source: Loading
zh_hans: 加载中

source: Local Fork Unavailable
zh_hans: 无法创建本地分叉

source: Local Handoff Failed
zh_hans: 移交到本地失败

source: Local and remote branches diverged
zh_hans: 本地与远程分支已分叉

source: Local branch ahead of remote
zh_hans: 本地分支领先远程

source: Local changes exist and remote branch moved ahead
zh_hans: 存在本地修改，且远程分支已有更新

source: Local changes need attention
zh_hans: 本地修改需要处理

source: Local commits stay on %@
zh_hans: 本地提交保留在 %@

source: Local repository has uncommitted changes
zh_hans: 本地仓库有未提交修改

source: Local
zh_hans: 本地

source: Locations
zh_hans: 位置

source: Login pending
zh_hans: 等待登录

source: Low
zh_hans: 低

source: Lower latency using Codex Fast Mode.
zh_hans: 使用 Codex 快速模式降低延迟。

source: Lower-latency turns for quick interactions
zh_hans: 以更低延迟快速交互

# Mac App 会启动内置 Bridge 并显示配对二维码。Codex、Git、项目和任务始终运行在 Mac。
source: The desktop app starts its bundled Bridge and shows a pairing QR code. Codex, Git, projects, and tasks stay on your device.
zh_hans: Mac App 会启动内置 Bridge 并显示配对二维码。Codex、Git、项目和任务始终运行在 Mac。

# Mac 上有较新的 Remodex.app 可用
source: A newer Remodex desktop app is available
zh_hans: Mac 上有较新的 Remodex.app 可用

# Mac 上的 Codex 版本过旧。Remodex 当前要求 codex-cli 0.147.0 或更高版本。
source: Codex on your device is outdated. Remodex requires codex-cli 0.147.0 or later.
zh_hans: Mac 上的 Codex 版本过旧。Remodex 当前要求 codex-cli 0.147.0 或更高版本。

# Mac 上的 Remodex.app 内置 Bridge 版本为 %@，iPhone 端要求 %@ 或更高版本。请更新 Mac App 后重新连接。
source: The desktop Bridge is %@, but iPhone requires %@ or later. Update the desktop app and reconnect.
zh_hans: Mac 上的 Remodex.app 内置 Bridge 版本为 %@，iPhone 端要求 %@ 或更高版本。请更新 Mac App 后重新连接。

# Mac 上的 Remodex.app 版本过旧。请更新到内置 Bridge %@ 或更高版本的 Mac App 后重新连接。
source: The desktop app is outdated. Update it to include Bridge %@ or later, then reconnect.
zh_hans: Mac 上的 Remodex.app 版本过旧。请更新到内置 Bridge %@ 或更高版本的 Mac App 后重新连接。

source: Manage queued prompts, active plans, file changes, and skill mentions through cleaner, more compact controls.
zh_hans: 使用更清晰、紧凑的控件管理排队提示词、当前计划、文件修改和技能引用。

source: Matching Folders
zh_hans: 匹配的文件夹

source: Medium
zh_hans: 中

source: Menu
zh_hans: 菜单

source: Message Bubble color
zh_hans: 消息气泡颜色

source: Message Bubble
zh_hans: 消息气泡

source: Method
zh_hans: 方法

source: Microphone access is off for Remodex.
zh_hans: Remodex 的麦克风权限已关闭。

source: Microphone access is required for voice transcription.
zh_hans: 语音转写需要麦克风权限。

source: Mint
zh_hans: 薄荷绿

source: Model options unavailable. Check the Mac connection.
zh_hans: 模型选项不可用，请检查设备连接。

source: Model
zh_hans: 模型

source: Model: %@, %@
zh_hans: 模型：%@，%@

source: Model: %@
zh_hans: 模型：%@

source: Monotonic counters
zh_hans: 单调递增计数器

source: More Reliable Workflows
zh_hans: 更可靠的工作流程

source: More actions
zh_hans: 更多操作

source: Move draft into input
zh_hans: 将草稿移入输入框

source: Moved
zh_hans: 已移动

source: Moving
zh_hans: 正在移动

source: My Devices
zh_hans: 设备

source: Name
zh_hans: 名称

source: Native terminal unavailable. Using text fallback.
zh_hans: 原生终端不可用，当前使用文本模式。

source: Need help?
zh_hans: 需要帮助？

source: Needs reauth
zh_hans: 需要重新认证

source: Needs review
zh_hans: 需要审核

source: Never sees decrypted message contents after the handshake
zh_hans: 握手后也无法看到解密的消息内容

source: New Chat
zh_hans: 新建任务

source: New Folder
zh_hans: 新建文件夹

source: New Goal
zh_hans: 新建目标

source: New Project
zh_hans: 新建项目

source: New QR Code
zh_hans: 新的二维码

source: New Server
zh_hans: 新建服务器

source: New Thread
zh_hans: 新建任务

source: New branch
zh_hans: 新建分支

source: New branch...
zh_hans: 新建分支…

source: New chat
zh_hans: 新建任务

source: New thread
zh_hans: 新建任务

source: New worktree
zh_hans: 新建工作树

source: Next step
zh_hans: 下一步

source: Next
zh_hans: 下一步

source: Nickname
zh_hans: 备注

source: No Project
zh_hans: 未选择项目

source: No Runtime Logs Yet
zh_hans: 暂无运行日志

source: No active turn available to steer
zh_hans: 没有可追加指令的活动轮次

source: No archived chats
zh_hans: 没有已归档任务

source: No branches found
zh_hans: 未找到分支

source: No changes
zh_hans: 没有修改

source: No chats
zh_hans: 没有任务

source: No child folders here.
zh_hans: 这里没有子文件夹。

source: No commands for /%@
zh_hans: 未找到 /%@ 对应的命令

source: No conversations
zh_hans: 没有任务

source: No current branch found.
zh_hans: 未找到当前分支。

source: No device paired yet
zh_hans: 尚未配对设备

source: No exact patch was captured.
zh_hans: 未记录可精确撤销的补丁。

source: No extra details yet.
zh_hans: 暂无更多详情。

source: No files or plugins for @%@
zh_hans: 未找到 @%@ 对应的文件或插件

source: No folders available
zh_hans: 没有可用文件夹

source: No local folders are available from this device.
zh_hans: 此设备没有可用的本地文件夹。

source: No matching chats
zh_hans: 没有匹配的任务

source: No matching conversations
zh_hans: 没有匹配的任务

source: No matching folders under this folder.
zh_hans: 此文件夹下没有匹配的文件夹。

source: No matching projects
zh_hans: 没有匹配的项目

source: No microphone input is available right now.
zh_hans: 目前没有可用的麦克风输入。

source: No models available
zh_hans: 没有可用模型

source: No paired device yet. Scan the QR code from your Mac to connect.
zh_hans: 尚未配对设备，请扫描设备上的二维码连接。

source: No paired devices yet.
zh_hans: 尚未配对任何设备。

source: No pending approval request
zh_hans: 没有待处理的审批请求

source: No project chats
zh_hans: 没有项目任务

source: No recent project chats yet.
zh_hans: 暂无最近的项目任务。

source: No skills for %@%@
zh_hans: 未找到 %@%@ 对应的技能

source: No trusted device is available to reconnect.
zh_hans: 没有可重连的可信设备。

source: No valid microphone input is available right now.
zh_hans: 目前没有有效的麦克风输入。

source: Normal
zh_hans: 正常

source: Not Now
zh_hans: 暂不

source: Not connected to bridge.
zh_hans: 尚未连接 Bridge。

source: Not connected to your paired device.
zh_hans: 尚未连接已配对设备。

source: Not logged in
zh_hans: 未登录

source: Not paired
zh_hans: 未配对

source: Nothing to Commit
zh_hans: 没有可提交的修改

source: Nothing to commit.
zh_hans: 没有可提交的修改。

source: Nothing to push.
zh_hans: 没有可推送的提交。

source: OK
zh_hans: 好

source: Off
zh_hans: 关闭

source: Offline
zh_hans: 离线

source: On first connect, the bridge prints a **QR code** containing:
zh_hans: 首次配对时，设备应用显示的**二维码**包含：

source: On
zh_hans: 开启

source: Only %@ images are allowed per message.
zh_hans: 每条消息最多允许 %@ 张图片。

source: Only ask for actions detected as potentially unsafe
zh_hans: 仅在检测到潜在不安全操作时询问

source: Only changes from this response will be reverted unless later edits overlap.
zh_hans: 仅撤销此回复的修改，除非后续编辑与其重叠。

source: Only managed worktrees can be cleaned up automatically.
zh_hans: 只能自动清理受管理的工作树。

source: Only observes connection metadata — session IDs, device IDs, timing
zh_hans: 只能处理连接元数据，如会话标识、设备标识和时间

source: Open Chat
zh_hans: 打开任务

source: Open Settings
zh_hans: 打开设置

source: Open System Settings → General → Sharing and turn on Remote Login. This enables SSH so trusted devices can open a terminal session.
zh_hans: 打开系统设置 → 通用 → 共享，开启“远程登录”，允许可信设备通过 SSH 打开终端。

source: Open Terminal Here
zh_hans: 在此打开终端

source: Open Terminal and create a dedicated SSH key for Remodex. The public half is allowed on the Mac; the private half is pasted into Remodex and should not be shared anywhere else.
zh_hans: 打开终端，为 Remodex 创建专用 SSH 密钥。将公钥配置到目标设备，私钥只粘贴到 Remodex，不应在其他地方分享。

source: Open active plan
zh_hans: 打开当前计划

source: Open child thread
zh_hans: 打开子任务

source: Open diff
zh_hans: 打开差异

source: Open elsewhere
zh_hans: 在其他位置打开

source: Open file changes diff
zh_hans: 打开文件修改差异

source: Open iPhone Settings, allow Microphone for Remodex, then try recording again.
zh_hans: 打开 iPhone 设置，允许 Remodex 使用麦克风，然后重新录音。

source: Open menu
zh_hans: 打开菜单

source: Open new terminal
zh_hans: 打开新终端

source: Open plan details
zh_hans: 打开计划详情

source: Open source on GitHub
zh_hans: 在 GitHub 查看源码

source: Open source
zh_hans: 开源

source: Open terminal to start a shell.
zh_hans: 打开终端以启动 Shell。

source: Open the plan card above the composer to review the current steps.
zh_hans: 打开输入框上方的计划卡片，查看当前步骤。

source: Open the prompt to review the plan and respond.
zh_hans: 打开提示以查看计划并回复。

source: Open worktree
zh_hans: 打开工作树

source: Opening the new chat
zh_hans: 正在打开新任务

source: Opens device switcher
zh_hans: 打开设备切换器

source: Opens the completed chat.
zh_hans: 打开已完成的任务。

source: Opens the project picker
zh_hans: 打开项目选择器

source: Opens the suggested recovery action
zh_hans: 打开建议的恢复操作

source: Opens thread location
zh_hans: 打开任务位置

source: Operation failed.
zh_hans: 操作失败。

source: Orange
zh_hans: 橙色

source: Other answer
zh_hans: 其他回答

source: Other chats also changed %@ of these file%@.
zh_hans: 其他任务也修改了其中 %@ 个文件%@。

source: Other models…
zh_hans: 其他模型…

source: Output (last %@ lines)
zh_hans: 输出（最后 %@ 行）

source: PR created
zh_hans: PR 已创建

source: PR fix
zh_hans: PR 修复

source: Pair with Code
zh_hans: 使用配对码

source: Pairing & Security
zh_hans: 配对与安全

source: Pairing Device
zh_hans: 正在配对设备

source: Pairing Error
zh_hans: 配对错误

source: Pairing, reconnects, and running chats now recover more reliably after sleep, relaunch, bridge restarts, or network loss.
zh_hans: 改善睡眠、重新启动、Bridge 重启或网络中断后的配对、重连及活动任务恢复。

source: Parent Folder
zh_hans: 上级文件夹

source: Passphrase (optional)
zh_hans: 密钥口令（可选）

source: Paste the contents of remodex_ed25519.pub into authorized_keys.
zh_hans: 将 remodex_ed25519.pub 的内容粘贴到 authorized_keys。

source: Paste your SSH private key before connecting.
zh_hans: 连接前请粘贴 SSH 私钥。

source: Paste
zh_hans: 粘贴

source: Patch %@ of %@
zh_hans: 补丁 %@ / %@

source: Patch conflict.
zh_hans: 补丁存在冲突。

source: Patch revert failed.
zh_hans: 补丁撤销失败。

source: Patch
zh_hans: 补丁

source: Path copied
zh_hans: 路径已复制

source: Path
zh_hans: 路径

source: Pause Goal
zh_hans: 暂停目标

source: Pause goal
zh_hans: 暂停目标

source: Paused
zh_hans: 已暂停

source: Pending
zh_hans: 待处理

source: Performance and Stability
zh_hans: 性能与稳定性

source: Phone conversations are first-class Codex sessions
zh_hans: 手机任务直接使用 Codex 会话

source: Photo library
zh_hans: 照片图库

source: Pick a base branch first
zh_hans: 请先选择基准分支

source: Pin
zh_hans: 置顶

source: Pink
zh_hans: 粉色

source: Pinned
zh_hans: 已置顶

source: Plan Accessory
zh_hans: 计划附件

source: Plan Mode, completed steps, message sending, attachments, and long-running sessions are now more dependable.
zh_hans: 提升计划模式、已完成步骤、消息发送、附件和长期任务的可靠性。

source: Plan in progress
zh_hans: 计划进行中

source: Plan mode is not supported by this runtime. Sent as a normal turn instead.
zh_hans: 此运行时不支持计划模式，已作为普通轮次发送。

source: Plan mode requires an available model before starting a plan turn.
zh_hans: 开始计划轮次前需要选择可用模型。

source: Plan mode
zh_hans: 计划模式

source: Plan ready
zh_hans: 计划已就绪

source: Plan
zh_hans: 计划

source: Platform
zh_hans: 平台

source: Please try again.
zh_hans: 请重试。

source: Plugins
zh_hans: 插件

source: Port
zh_hans: 端口

source: Prepare feature branch
zh_hans: 准备功能分支

source: Preparing an empty conversation.
zh_hans: 正在准备空任务。

source: Preparing child thread
zh_hans: 正在准备子任务

source: Preparing feature branch...
zh_hans: 正在准备功能分支…

source: Preparing microphone
zh_hans: 正在准备麦克风

source: Preparing recent messages for this conversation.
zh_hans: 正在准备此任务的最近消息。

source: Preparing reconnect...
zh_hans: 正在准备重连…

source: Preparing worktree...
zh_hans: 正在准备工作树…

source: Previous Pair
zh_hans: 上次配对

source: Previous
zh_hans: 上一步

source: Primary
zh_hans: 主要

source: Private key saved
zh_hans: 私钥已保存

source: Private key
zh_hans: 私钥

source: Processed the update
zh_hans: 已处理更新

source: Produces JSONL rollout files under `~/.codex/sessions/`
zh_hans: 在 `~/.codex/sessions/` 下生成 JSONL 运行记录

source: Projects selected
zh_hans: 已选项目

source: Projects
zh_hans: 项目

source: Prompt copied
zh_hans: 提示词已复制

source: Proposed plan cannot be empty
zh_hans: 建议计划不能为空

source: Proposed plan
zh_hans: 建议计划

source: Pull Failed
zh_hans: 拉取失败

source: Pull failed due to conflicts.
zh_hans: 因冲突导致拉取失败。

source: Pull remote changes before creating a PR.
zh_hans: 创建 PR 前请先拉取远程修改。

source: Pull request opened
zh_hans: PR 已打开

source: Pulled
zh_hans: 已拉取

source: Pulling
zh_hans: 正在拉取

source: Purple
zh_hans: 紫色

source: Push completed on %@.
zh_hans: 已推送到 %@。

source: Push completed on %@/%@.
zh_hans: 已推送到 %@/%@。

source: Push completed on remote.
zh_hans: 远程推送已完成。

source: Push rejected. Pull changes first.
zh_hans: 推送被拒绝，请先拉取修改。

source: Push
zh_hans: 推送

source: Pushed
zh_hans: 已推送

source: Pushing
zh_hans: 正在推送

source: Questionnaire answers cannot be empty
zh_hans: 问题答案不能为空

source: Questions
zh_hans: 问题

source: Queue paused: %@
zh_hans: 队列已暂停：%@

source: Queue paused:
zh_hans: 队列已暂停：

source: Queued for spawn
zh_hans: 等待创建

source: Queued messages
zh_hans: 排队消息

source: Queued plan
zh_hans: 排队计划

source: Queued to close
zh_hans: 等待关闭

source: Queued to resume
zh_hans: 等待恢复

source: Queued update
zh_hans: 排队更新

source: Queued
zh_hans: 已排队

source: Quick Chat
zh_hans: 快捷任务

# RDX2: 开头的完整配对码
source: Complete pairing code starting with RDX2:
zh_hans: RDX2: 开头的完整配对码

source: Ran %@ commands
zh_hans: 已运行 %@ 条命令

source: Ran
zh_hans: 已运行

source: Rate limits are unavailable for this account.
zh_hans: 无法获取此账号的用量限额。

source: Rate limits
zh_hans: 用量限额

source: Re-pair required
zh_hans: 需要重新配对

source: Read %@
zh_hans: 读取 %@

source: Read file
zh_hans: 读取文件

source: Read
zh_hans: 读取

source: Reading
zh_hans: 正在读取

source: Reasoning
zh_hans: 推理

source: Recent branches
zh_hans: 最近分支

source: Recommended private-key format: OpenSSH Ed25519 with a passphrase, created by ssh-keygen above. Remodex also accepts encrypted PKCS#8 and encrypted legacy PEM keys; unencrypted keys work only if you explicitly enable that option on the profile. In Remodex, use the Windows username, PC IPv4 address, port 22, and the matching private key. Administrator accounts use C:\ProgramData\ssh\administrators_authorized_keys instead.
zh_hans: 推荐使用带口令的 OpenSSH Ed25519 私钥。Remodex 也支持加密的 PKCS#8 和旧版 PEM；只有在配置中明确允许后才接受未加密密钥。填写 Windows 用户名、电脑 IPv4 地址、22 端口和对应私钥。管理员账号使用 C:\ProgramData\ssh\administrators_authorized_keys。

source: Reconnect to your device to keep this chat in sync.
zh_hans: 重新连接设备以同步此任务。

source: Reconnect to your local Codex bridge to refresh the model list.
zh_hans: 重新连接设备上的 Codex Bridge 以刷新模型列表。

source: Reconnect to your paired device first.
zh_hans: 请先重新连接已配对设备。

source: Reconnect to your paired device or scan a new QR code first.
zh_hans: 请先重新连接已配对设备或扫描新二维码。

source: Reconnect
zh_hans: 重新连接

source: Reconnecting securely
zh_hans: 正在安全重连

source: Reconnecting
zh_hans: 正在重连

source: Red
zh_hans: 红色

source: Redesigned Composer
zh_hans: 全新输入框

source: Refresh
zh_hans: 刷新

source: Relay handshake response could not be decoded
zh_hans: 无法解码中继握手响应

source: Relay handshake response was too large
zh_hans: 中继握手响应过大

source: Relay rejected websocket upgrade
zh_hans: 中继拒绝 WebSocket 升级

source: Relay returned an invalid websocket accept key
zh_hans: 中继返回了无效的 WebSocket 握手密钥

# Relay 只负责设备会合与端到端密文转发；Codex、Git、项目和聊天正文始终留在你的 Mac 与 iPhone。
source: Relay only handles rendezvous and encrypted forwarding. Codex, Git, projects, and task content remain on your devices.
zh_hans: Relay 只负责设备会合与端到端密文转发；Codex、Git、项目和聊天正文始终留在你的 Mac 与 iPhone。

source: Reliable Recovery
zh_hans: 可靠恢复

source: Reload branch list
zh_hans: 重新加载分支列表
